rhead_sharepoint_ip/soap_requests/GetListItems.txt

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetListItems xmlns="http://schemas.microsoft.com/sharepoint/soap/">
      <listName>%@</listName>
      <viewName></viewName>
      <query>
        <Query/>
	  </query>
      <viewFields>
        <ViewFields/>
	  </viewFields>
      <rowLimit>%@</rowLimit>
      <queryOptions>
        <QueryOptions/>
	  </queryOptions>
      <webID></webID>
    </GetListItems>
  </soap:Body>
</soap:Envelope>