target/test-classes/test-classes/test-classes/test-classes/test-classes/test-classes/test-classes/test-classes/test-classes/test-classes/test-classes/bodies/0071_request.dat

<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'><soap:Body><GetListItems xmlns='http://schemas.microsoft.com/sharepoint/soap/'><listName>Productos Destacados</listName><viewName></viewName><query><Query><OrderBy><FieldRef Name='Orden' Ascending='True'/></OrderBy></Query></query><viewFields><ViewFields Properties='True' /></viewFields><rowLimit>0</rowLimit><queryOptions><QueryOptions></QueryOptions></queryOptions></GetListItems></soap:Body></soap:Envelope>