dnd/FormFaces/Examples/Test Pages/namedBind.html

<!DOCTYPE
  html PUBLIC "-//W3C//DTD XHTML 1.0//EN"
  "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<!-- Progeny Proprietary Information
     Copyright 2000-2005 Progeny Systems Corporation. All Rights Reserved.
-->

<html xmlns="http://www.w3.org/1999/xhtml" xmlns:xf="http://www.w3.org/2002/xforms" 
xmlns:xforms="http://www.w3.org/2002/xforms" xmlns:ev="http://www.w3.org/2001/xml-events" 
xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:m="http://schemas.microsoft.com/sharepoint/soap/"
xml:lang="en">
  <head>
    <title>Named &lt;bind/&gt;</title>
    
    <link rel="stylesheet" type="text/css" href="xforms.css" />
    <!--script type="text/javascript" src="../Source/sarissa/sarissa.js"></script-->
    <script type="text/javascript" src="../../formfaces.js"></script>
    
    <xf:model id="model1">
      <xf:instance>
        <data xmlns=""><number>]]&gt;</number></data>
      </xf:instance>
      
      <xf:instance id="iGetAttachmentCollection">
        <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
          <SOAP-ENV:Body>
            <m:GetAttachmentCollection xmlns:m="http://schemas.microsoft.com/sharepoint/soap/">
              <m:listName>Workflow4</m:listName>
              <m:listItemID>4</m:listItemID>
            </m:GetAttachmentCollection>
          </SOAP-ENV:Body>
        </SOAP-ENV:Envelope>
      </xf:instance>

      <xf:submission id="submission"
                     action="http://www.dependencymodel.com/_vti_bin/Lists.asmx"
                     method="post"
                     replace="none"
                     omit-xml-declaration="true" 
                     ref="instance('iGetAttachmentCollection')" mediatype="text/xml; charset=utf-8"
      />
      <!--xf:action ev:event="xforms-ready">
      <xf:send submission="submission" />
      </xf:action-->
      <xf:bind id="ItemID" nodeset="instance('iGetAttachmentCollection')//m:GetAttachmentCollection/m:listItemID" />
    </xf:model>
  </head>
  
  <body>
    <p>You should see the number 4 in both of the input controls below.</p>
  
<xf:input ref="instance('iGetAttachmentCollection')//m:GetAttachmentCollection/m:listItemID">
<xf:label>List Item (ref): </xf:label>
</xf:input>
<xf:input bind="ItemID">
<xf:label>List Item (bind): </xf:label>
</xf:input>

  <p id="status"></p>

  </body>
</html>